{"Introction_Title":"Relax in Our Luxurious Desert Pods","Introction_Description":"Our desert accommodations are designed to provide both comfort and a connection to the natural surroundings. Each pod is equipped with modern amenities, ensuring you have everything needed for a comfortable stay, including air conditioning, quality bedding, and a private bathroom. The location offers a peaceful setting, allowing you to relax and enjoy the quiet beauty of the desert. This is a place where you can truly disconnect, find rest, and appreciate the simplicity of nature.","The_Leaf_Title":"The Leaf","The_Leaf_Description":"Nestled in the heart of the King Khalid Royal Reserve, The Leaf offers a perfect blend of comfort and nature. Our glamping experience provides a unique opportunity to disconnect from the world and reconnect with yourself. Enjoy cool desert breezes, starry nights, and a range of activities from rock climbing to stargazing. The Leaf is ideal for weekends, holidays, and corporate retreats, all designed with sustainability and community integration in mind.\nLeaf","The_Leaf_Right_Title":"Where Classic Camping Meets Contemporary Luxury","The_Leaf_Right_Description":"The Leaf’s enchanting setting offers a unique blend of luxury and natural beauty, where the vast sky above meets the serene desert below. Here, under a canopy of stars, guests can experience the magic of the Arabian night while enjoying modern comforts. The Leaf isn't just a place to stay; it's an immersive journey into the heart of Saudi Arabia's captivating wilderness, promising unforgettable moments and a deep connection with the stunning surroundings.","Section_Banner_Title":"Reconnect and Restore in Nature’s Embrace","Section_Banner_Description":"Take a moment to escape the hustle and reconnect with the natural world. Feel the tranquility, inhale the fresh air, and allow the serene environment to restore your inner peace and harmony.","Room_Offer_Title":"What our rooms offer","Rooms_Offer_Description":"Our rooms are thoughtfully designed to provide you with the perfect blend of comfort and convenience during your stay.","Rooms_offer_Title":"What our rooms offer","Rooms_Offer_Point1":"King and Twin Beds ","Rooms_Offer_Point2":"Closet","Rooms_Offer_Point3":"Mini Bar","Rooms_Offer_Point4":"Indoor seating area with panoramic views ","Rooms_Offer_Point5":"Private Bathroom with shower, toilet and wash facilities Fresh","Rooms_Offer_Point6":"Towels","Rooms_Offer_Point7":"Bathrobes and Slippers ","Rooms_Offer_Point8":"Guest amenities ","Rooms_Offer_Point9":"One extra bed on request at no charge ","Rooms_Offer_Point10":"Heating and Airconditioning ","Rooms_Offer_Point11":"External Seating Area ","Rooms_Offer_Point12":"Bag of firewood for cleaning ","Junior_Suite_Title":"Junior Suite Domes","Junior_Suite_Description":"The Junior Suite are perfect for those looking to indulge in the ultimate comfort.","Junior_Suite_Right_Title":"Junior Suite Domes","Junior_Suite_Right_Description":"The junior suite Dome offer a truly elevated glamping experience, combining luxury with the serenity of nature. These domes come equipped with all the modern amenities you could need. You’ll sleep in comfort on King beds with premium Pollysateen bedding. For your security, a safe for valuables is provided. The private bathroom in the junior suite is a highlight, offering a shower, toilet, basin, and other amenities. These features make the junior suite perfect for those looking to indulge in the ultimate comfort.","Room_Type_Title":"Room Types","Dining_Title":"Dining","Dining_Description":"Our dining experience brings together fresh, local ingredients and international flavors to create an unforgettable culinary experience. Light meals are available from 10 AM to 10 PM, with Hookah, coffee, and refreshments served throughout the day. Group dining menus can be arranged upon request, with live BBQ cooking for five or more. Meals can also be delivered directly to your Dome through a QR menu provided in each Dome.","Dining_Button1":"Appetizers","Dining_Button2":"Starters","Dining_Button3":"Main Course","Dining_Button4":"Dessert","Dining_Button5":"Beverages","Main_Course_para2":"Signature firewood rotisserie","Main_Course_para3":"Succulent lamb slow-cooked to perfection over a crackling firewood rotisserie. This traditional cooking method infuses the meat with a smoky depth, served with a rich, flavorful jus\n","Main_Course_para4":"Fire-grilled shrimp","Main_Course_para5":"Fire-cooked shrimp, marinated with sriracha sambal, accompanied by grilled lime","Main_Course_para6":"Black angus beef tagliata","Main_Course_para7":"Firewood-grilled black angus beef, tender and succulent, kissed with a goma sesame glaze, nested in a toss of tagliatelle vegetables","Main_Course_para8":"Sides","Main_Course_para9":"Fire-grilled farm vegetable tian","Main_Course_para10":"Selection of fire-grilled vegetables, in a tangy tomato sauce, drizzled with rich pesto","Main_Course_para11":"Future farm local mushroom freekeh risotto","Main_Course_para12":"A creamy harmony of freekeh, mushroom, and asparagus, enriched with the nutty essence of parmesan cheese","Main_Course_para13":"Baked potato wedges","Main_Course_para14":"Crunchy potato wedges, baked with onion and olive oil","Experiences_Title":"Experiences","Experiences_Description":"We revolutionize the concept of travel by artfully combining exciting and unique adventures with serene wellness retreats in the heart of nature.","Room_Type_Left_Image_Title":"Junior Suite with Twin beds","Room_Type_Right_Image_Title":"Junior Suite with King Bed","Rooms_Offer_Point13":"Bag of firewood for cleaning","Rooms_Offer_Point14":"Parking next to your Dome ","Rooms_Offer_Point15":"Housekeeping services once a day ","Rooms_Offer_Point16":"Light meal menu available via our QR code ","Rooms_Offer_Point17":"Bag of wood for them to enjoy campfires (extra bags are available to purchase on request)","Experience_Right_Para_Description":"Our luxurious accommodations serve as the perfect backdrop for these thoughtfully designed experiences, where excitement meets tranquility. Every aspect of our curated journeys is tailored to create a harmonious balance, allowing you to fully immerse yourself in the thrill of exploration while simultaneously rejuvenating your body, mind, and spirit. Whatever you're seeking, our offerings provide the ultimate travel experience, leaving you refreshed and inspired."}