{"Choose_your_path_Title":"Choose your path...","Choose_your_path_Description":"Experience the wonders of Saudi Arabia with DRB Arabia, your gateway to extraordinary journeys. Our team, with over 100 years of combined travel expertise, curates unique experiences that showcase the Kingdom's natural landscapes and rich biodiversity, from mountain ranges to desert valleys. For those seeking a distinctive escape, our glamping adventures offer the perfect mix of nature and comfort. Explore diverse terrains, immerse yourself in outdoor activities like hiking, camping, and nature photography, or simply connect with the pristine environment. At DRB Arabia, we are dedicated to sustainable travel, ensuring that your journey positively impacts both the land and its communities. Whether you're interested in small group tours or special interest experiences, we're here to create your ideal Saudi Arabian adventure.","The_Leaf_Title":"The Leaf","The_Leaf_Description":"Nestled in the heart of the King Khalid Royal Reserve, The Leaf offers a perfect blend of comfort and nature. Our glamping experience provides a unique opportunity to disconnect from the world and reconnect with yourself. Enjoy cool desert breezes, starry nights, and a range of activities from rock climbing to stargazing. The Leaf is ideal for weekends, holidays, and corporate retreats, all designed with sustainability and community integration in mind.","The_Leaf_Right_Para":"The Leaf’s enchanting setting offers a unique blend of luxury and natural beauty, where the vast sky above meets the serene desert below. Here, under a canopy of stars, guests can experience the magic of the Arabian night while enjoying modern comforts. The Leaf isn't just a place to stay; it's an immersive journey into the heart of Saudi Arabia's captivating wilderness, promising unforgettable moments and a deep connection with the stunning surroundings.","Section_Banner_Title":"Find Balance and Renewal in Nature","Section_Banner_Description":"It's important to slow down and reconnect with nature to refresh both mind and body. Enjoy the peace, breathe deeply, and let the natural surroundings bring you back to a state of balance and well-being.","Accommodation_Title":"Accommodation","Accommodation_Right_Title":"Junior Suite Domes","Accommodation_Right_Description":"The Junior Suite offers premium glamping experience, combining luxury with the serenity of nature. These pods come equipped with all the modern amenities you could need. You’ll sleep in comfort on King beds with premium Pollysateen bedding. The private bathroom in the Junior Suite is a highlight, offering a shower, toilet, basin, and other amenities. These features make the Junior Suite perfect for those looking to indulge in the ultimate comfort.","Accommodation_Left_Title":"Corporate Events","Accommodation_Left_Description":"Improve your corporate retreats and team-building exercises in this inspiring landscape. Our state-of-the-art facilities integrate with the natural surroundings, providing a productive and creative space. With strategy sessions in our eco-domes and adventure-based team activities, we offer a refreshing alternative to traditional corporate venues, encouraging innovation and collaboration in harmony with nature.","Rooms_Offer_Title":"What our rooms offer","Rooms_Offer_Description":"Our rooms are thoughtfully designed to provide you with the perfect blend of comfort and convenience during your stay.","Rooms_Offer_Point1":"King and Twin Beds","Rooms_Offer_Point2":"Safe for valuables","Rooms_Offer_Point3":"Smoke detectors and sprinklers","Rooms_Offer_Point4":"Sufficient storage options","Rooms_Offer_Point5":"Private bathroom","Rooms_Offer_Point6":"Bathroom amenities","Rooms_Offer_Point7":"WIFI","Rooms_Offer_Point8":"Air conditioning","Rooms_Offer_Point9":"Minibar","Rooms_Offer_Point10":"Coffee station","Rooms_Offer_Point11":"King and Twin beds","Rooms_Offer_Point12":"Wardrobe facilities","Dining_Title":"Dining","Dining_Description":"Our dining experience brings together fresh, local ingredients and international flavors to create an unforgettable culinary experience. Light meals are available from 10 AM to 10 PM, with Hookah, coffee, and refreshments served throughout the day. Group dining menus can be arranged upon request, with live BBQ cooking for five or more. Meals can also be delivered directly to your Dome through a QR menu provided in each Dome.","Experiences_Title":"Experiences","Experiences_Description":"We revolutionize the concept of travel by artfully combining exciting and unique adventures with serene wellness retreats in the heart of nature.","Experiences_Right_Para1":"Our luxurious accommodations serve as the perfect backdrop for these thoughtfully designed experiences, where excitement meets tranquility. Every aspect of our curated journeys is tailored to create a harmonious balance, allowing you to fully immerse yourself in the thrill of exploration while simultaneously rejuvenating your body, mind, and spirit. Whatever you're seeking, our offerings provide the ultimate travel experience, leaving you refreshed and inspired.","Something_for_everyone_Title":"Something for everyone","Private_Events_Right_Title":"Private Events","Private_Events_Right_Para":"We a stunning setting for any occasion, whether it's a small celebration or a large event. Our events are set against a backdrop of diverse ecosystems and unique landscapes, from mountain ranges to serene valleys. Enjoy customized event planning, gourmet dining under the stars, and exclusive access to our facilities, all while immersed in the serene beauty of the Saudi Arabian desert.","Corporate_Events_Left_Title":"Corporate Events","Corporate_Events_Left_Description":"Improve your corporate retreats and team-building exercises in this inspiring landscape. Our state-of-the-art facilities integrate with the natural surroundings, providing a productive and creative space. With strategy sessions in our eco-domes and adventure-based team activities, we offer a refreshing alternative to traditional corporate venues, encouraging innovation and collaboration in harmony with nature.","The_Leaf_Left_Description":"The Leaf offers a harmonious blend of nature and luxury, providing a tranquil escape in the heart of the desert.","The_Leaf_Right_Title":"Where Classic Camping Meets Contemporary Luxury","The_Leaf_Right_Description":"Nestled in the heart of the King Khalid Royal Reserve, The Leaf offers a perfect blend of comfort and nature. Our glamping experience provides a unique opportunity to disconnect from the world and reconnect with yourself. Enjoy cool desert breezes, starry nights, and a range of activities from rock climbing to stargazing. The Leaf is ideal for weekends, holidays, and corporate retreats, all designed with sustainability and community integration in mind.","Experience_Title":"The Experience","Experience_Description":"Tranquility and comfort are at the forefront of your stay. Enjoy the calm ambiance of the desert, complemented by luxurious touches that make your glamping experience both relaxing and memorable.","Experience_Right_Title":"Where Classic Camping Meets Contemporary Luxury","Sustainability_Right_Para_Title":"Committed to Conservation","Sustainability_Right_Para_Description":"DRB Arabia, and Leaf Camps pride themselves in their sustainability program. Located within the Kingdom’s Royal Reserves and the natural and historic environment they offer, the Leaf Camps follow strict practices of bio-degradable products, recyclable waste, energy conservation including biodegradable and recycled products; no plastic, and energy saving management systems. The company ensures through ongoing education of its Team members to respect, understand and promote the care of the natural flora and fauna, and the wildlife in whose natural environment they share.","Sustainability_Title":"Sustainability"}