{"Experience_Right_Description":"Immerse yourself in a stay at one of 14 uniquely designed domes that harmonize modern comfort with sweeping views of the desert, creating the perfect sanctuary for rest and exploration. \n\nAs night descends, choose between an enchanting camel ride or an exhilarating jeep journey into the deep red sands, leading you to an exclusive stargazing spot where the mysteries of the universe unfold, revealing the Milky Way in breathtaking clarity.\n","The_Leaf_Description":"Located deep in the red sand desert, The Leaf of Ha’il offers astro-tourists an incredible stargazing adventure in a Dark Sky zone, where you can uncover the wonders of the night sky and the Milky Way. Offering a culturally authentic experience, including camel rides to see the stars and enjoying authentic local cuisine, our astro-tourist guests will be accommodated in our luxurious Leaf of Ha’il glamping accommodation. The Leaf of Ha’il focuses on sustainability, integration with the local community, and is ideal for avid stargazers, holiday visitors, and corporate retreats.","Experience_Title":"The Dark Sky Experience","Experience_Description":"The Leaf of Ha'il Dark Sky Experience is more than just an evening of stargazing\n\n","The_Leaf_Right_Title":"Extraordinary blend of culture, adventure, and cosmic discovery","Experience_Right_Title":"Extraordinary blend of culture, adventure, and cosmic discovery","Accommodation_Description":"Each of the 14 domes is thoughtfully crafted to offer modern amenities while showcasing the rich heritage of the region. These cozy, scenic retreats promise both relaxation and a touch of adventure, with panoramic views that connect you to the beauty of the desert.","Dining_Title":"Arrival and Dining","Dining_Description":"Arrive between 1:00 PM and 2:00 PM and be greeted with a traditional Arabian lunch, featuring regional dishes steeped in cultural flavours and prepared with time-honoured recipes. After your meal, enjoy a peaceful afternoon to relax and absorb the serene atmosphere before the evening’s adventure begins.","Experiences_Title":"Evening Under the Stars","Experiences_Right_Para1":"At 6:00 PM, the adventure kicks off. Choose between a tranquil camel ride or an invigorating jeep tour that takes you 4 km into the vast expanse of the desert. As twilight transitions to night, a guide awaits to share fascinating tales of constellations and celestial wonders. Seated in a U-shaped formation, guests listen to the storytelling and take turns gazing through a powerful telescope, exploring the night sky in stunning detail. This Dark Sky location promises a view so clear, that you’ll see the Milky Way stretching above you in vivid splendour. At midnight, the adventure concludes as guests make their way back to the domes. The peaceful journey back provides a final chance to reflect on the night’s experiences and the marvels of the universe.","Experiences_Description":"Embark on a desert journey to witness the Milky Way"}